Revit 2027 API
UnitFormatUtils.Format(Units, ForgeTypeId, Double, Boolean) Method
 Formats a number with units into a string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string Format(
	Units units,
	ForgeTypeId specTypeId,
	double value,
	bool forEditing
)
Public Shared Function Format (
	units As Units,
	specTypeId As ForgeTypeId,
	value As Double,
	forEditing As Boolean
) As String
public:
static String^ Format(
	Units^ units,
	ForgeTypeId^ specTypeId,
	double value,
	bool forEditing
)
static member Format :
        units : Units *
        specTypeId : ForgeTypeId *
        value : float *
        forEditing : bool -> string
Parameters
units Units
 The units formatting settings, typically obtained from Document.GetUnits().
specTypeId ForgeTypeId
 Identifier of the spec of the value to format.
value Double
 The value to format, in Revit's internal units.
forEditing Boolean
 True if the formatting should be modified as necessary so that the formatted string can be successfully parsed, for example by suppressing digit grouping. False if unmodified settings should be used, suitable for display only.
Return Value
String
 The formatted string.
Exceptions
Exception | Condition
ArgumentException |  specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId). -or- The given value for value is not finite
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UnitFormatUtils Class
Format Overload
Autodesk.Revit.DB Namespace